{
  "nav.home": "Beranda",
  "nav.about": "Tentang",
  "nav.projects": "Proyek",
  "nav.skills": "Keahlian",
  "nav.experience": "Pengalaman",
  "nav.education": "Pendidikan",
  "nav.contact": "Kontak",
  "nav.creator": "Pencipta",
  "nav.services": "Layanan",
  "nav.techStack": "Teknologi",
  "nav.clients": "Klien",

  "hero.title": "Selamat datang di",
  "hero.name": "Elephantio",
  "hero.subtitle": "Ini adalah showcase Pengembangan Web yang dibangun oleh Harun Al Rosyid. Menampilkan aplikasi web dan mobile yang responsif dan skalabel menggunakan React, React Native, dan alat frontend modern.",
  "hero.explore": "Jelajahi Karya Saya",
  "hero.contact": "Hubungi Saya",

  "techStack.title": "Stack Teknologi",
  "techStack.heading": "Alat & Teknologi yang saya gunakan",
  "techStack.subtitle": "Saya memanfaatkan teknologi modern untuk membangun aplikasi yang kuat, skalabel, dan ramah pengguna di platform web dan mobile.",

  "clients.title": "Klien & Proyek",
  "clients.heading": "Perusahaan yang telah saya layani",
  "clients.subtitle": "Saya memiliki keistimewaan bekerja dengan perusahaan-perusahaan luar biasa ini dan memberikan solusi yang berdampak.",
  "clients.featuredProjects": "Proyek Unggulan",
  "clients.trustedBy": "Dipercaya Oleh",
  "clients.testimonial": "Harun adalah pengembang luar biasa yang secara konsisten memberikan pekerjaan berkualitas tinggi. Keahlian teknis dan kemampuan pemecahan masalahnya sangat berharga untuk proyek-proyek kami.",

  "creator.title": "Sang Pencipta",
  "creator.heading": "Kenali Harun Al Rosyid",
  "creator.subtitle": "Pengembang yang penuh semangat di balik Elephantio",
  "creator.role": "Pengembang Full-Stack & Penggemar UI/UX",
  "creator.bio1": "Harun Al Rosyid adalah pengembang berpengalaman dengan lebih dari 5 tahun pengalaman dalam menciptakan aplikasi web dan mobile yang indah dan fungsional. Dengan hasrat untuk kode yang bersih dan pengalaman pengguna yang intuitif, Harun mewujudkan ide-ide melalui desain yang bijaksana dan implementasi yang kuat.",
  "creator.bio2": "Mengkhususkan diri dalam React, React Native, dan framework JavaScript modern, Harun telah bekerja di berbagai industri termasuk keuangan, e-commerce, dan solusi perusahaan. Elephantio mewakili visinya untuk menciptakan proyek showcase yang mendemonstrasikan kemungkinan pengembangan web modern.",
  "creator.achievement1.title": "5+ Tahun Pengalaman",
  "creator.achievement1.desc": "Dalam pengembangan web dan mobile di berbagai industri",
  "creator.achievement2.title": "50+ Proyek Selesai",
  "creator.achievement2.desc": "Dari website bisnis kecil hingga aplikasi perusahaan",
  "creator.achievement3.title": "Kepemimpinan Tim",
  "creator.achievement3.desc": "Berhasil memimpin tim pengembangan dalam berbagai proyek",
  "creator.connect": "Hubungi Harun",

  "services.title": "Layanan Profesional",
  "services.heading": "Bagaimana saya dapat membantu Anda",
  "services.subtitle": "Saya menawarkan layanan pengembangan komprehensif yang disesuaikan dengan kebutuhan spesifik Anda, dengan keahlian dalam teknologi berbasis JavaScript dan adaptasi cepat terhadap framework dan alat baru.",
  "services.cta": "Diskusikan Proyek Anda",

  "services.web.title": "Pengembangan Web",
  "services.web.description": "Aplikasi web kustom yang dibangun dengan framework JavaScript modern, berfokus pada performa, responsivitas, dan pengalaman pengguna.",

  "services.mobile.title": "Pengembangan Mobile",
  "services.mobile.description": "Aplikasi mobile seperti native untuk iOS dan Android menggunakan React Native, dengan integrasi fitur perangkat yang mulus.",

  "services.fullstack.title": "Solusi Full-Stack",
  "services.fullstack.description": "Pengembangan end-to-end dari desain database hingga implementasi frontend, menciptakan aplikasi yang kohesif dan skalabel.",

  "services.consulting.title": "Konsultasi Teknis",
  "services.consulting.description": "Saran ahli tentang arsitektur, pemilihan teknologi, dan strategi implementasi untuk proyek pengembangan Anda.",

  "services.collaboration.heading": "Cara Bekerja Sama",
  "services.collaboration.subtitle": "Saya menawarkan opsi kolaborasi yang fleksibel untuk paling sesuai dengan kebutuhan dan timeline proyek Anda",

  "services.collaboration.freelance.title": "Berbasis Proyek",
  "services.collaboration.freelance.description": "Ideal untuk proyek spesifik dengan ruang lingkup dan timeline yang jelas, dengan deliverable dan milestone yang terukur.",

  "services.collaboration.contract.title": "Kontrak Kerja",
  "services.collaboration.contract.description": "Waktu pengembangan yang didedikasikan untuk proyek berkelanjutan atau kolaborasi yang diperpanjang dengan tim Anda.",

  "services.collaboration.employee.title": "Peran Penuh Waktu",
  "services.collaboration.employee.description": "Integrasi lengkap dengan tim Anda sebagai karyawan untuk proyek jangka panjang dan pengembangan berkelanjutan.",

  "services.approach.heading": "Pendekatan Saya terhadap Teknologi",
  "services.approach.description": "Saya percaya dalam menggunakan alat yang tepat untuk pekerjaan, dengan JavaScript sebagai ekosistem utama saya. Saya terus belajar dan beradaptasi dengan teknologi baru, memastikan proyek Anda mendapat manfaat dari praktik terbaik modern sambil mempertahankan stabilitas dan performa.",

  "about.title": "Profil Profesional",
  "about.heading": "Memberikan solusi berdampak tinggi",
  "about.paragraph1": "Dengan pengalaman lebih dari 5 tahun di industri pengembangan perangkat lunak, saya mengkhususkan diri dalam merancang dan mengembangkan aplikasi web dan mobile yang responsif dan skalabel yang memberikan pengalaman pengguna yang luar biasa.",
  "about.paragraph2": "Saya telah berhasil memimpin tim, mengelola alur kerja proyek, dan berkolaborasi dengan tim lintas fungsi untuk menghadirkan aplikasi tingkat perusahaan di industri keuangan dan distribusi.",
  "about.expertise": "Keahlian Teknis",
  "about.expertise.desc": "React, React Native, Redux, TypeScript, dan alat pengembangan frontend modern",
  "about.industry": "Pengalaman Industri",
  "about.industry.desc": "Sektor Keuangan, Perbankan, FMCG, Retail, dan Layanan IT",

  "projects.title": "Proyek Terbaru",
  "projects.heading": "Karya yang menginspirasi",
  "projects.subtitle": "Lihat bagaimana kami menerapkan prinsip desain harmonis dalam proyek-proyek terbaru kami.",
  "projects.viewDetails": "Lihat Detail",

  "portfolio.title": "Semua Proyek",
  "portfolio.heading": "Portfolio Lengkap Saya",
  "portfolio.subtitle": "Jelajahi semua proyek saya dan klik pada salah satu untuk melihat detail lebih lanjut",

  "skills.title": "Keahlian Teknis",
  "skills.heading": "Keahlian profesional",
  "skills.subtitle": "Dengan beragam keterampilan dan pengalaman di berbagai teknologi, saya memberikan solusi komprehensif untuk aplikasi web dan mobile modern.",

  "experience.title": "Pengalaman Kerja",
  "experience.heading": "Perjalanan profesional",
  "experience.subtitle": "Jalur karir saya telah membekali saya dengan beragam keterampilan dan pengalaman dalam menciptakan produk digital yang luar biasa di berbagai industri.",
  "experience.download": "Unduh Resume",
  "experience.viewDetails": "Klik untuk melihat detail",

  "education.title": "Pendidikan",
  "education.heading": "Latar belakang akademis",
  "education.subtitle": "Perjalanan pendidikan saya telah memberikan fondasi yang kuat dalam teknologi informasi dan pengembangan perangkat lunak.",

  "contact.title": "Hubungi Saya",
  "contact.heading": "Mari berkolaborasi",
  "contact.subtitle": "Punya proyek dalam pikiran atau tertarik untuk bekerja sama? Jangan ragu untuk menghubungi dan mari diskusikan bagaimana saya dapat membantu.",
  "contact.name": "Nama Anda",
  "contact.email": "Email Anda",
  "contact.subject": "Subjek",
  "contact.message": "Pesan Anda",
  "contact.placeholder.name": "John Doe",
  "contact.placeholder.email": "john@example.com",
  "contact.placeholder.subject": "Bagaimana saya dapat membantu Anda?",
  "contact.placeholder.message": "Ceritakan tentang proyek Anda...",
  "contact.send": "Kirim via Aplikasi Email",
  "contact.form.description": "Isi formulir ini untuk mengirim email kepada saya langsung dari aplikasi email Anda. Semua kolom wajib diisi.",
  "contact.collaborate": "Mari Berkolaborasi",
  "contact.collaborate.desc": "Terhubung dengan saya di GitHub dan LinkedIn untuk melihat lebih banyak karya dan latar belakang profesional saya.",
  "contact.email.click": "Klik untuk mengirim email",
  "contact.whatsapp.click": "Klik untuk chat di WhatsApp",

  "footer.rights": "Semua hak dilindungi.",
  "footer.madeWith": "Dibuat dengan",
  "footer.in": "di Indonesia",
  "footer.quickLinks": "Tautan Cepat",
  "footer.getInTouch": "Hubungi Saya",
  "footer.getInTouch.desc": "Punya proyek dalam pikiran atau ingin bekerja sama? Jangan ragu untuk menghubungi!",
  "footer.contactMe": "Hubungi Saya"
}
